[
    {
        "id":"1",
        "name": "Graduação em Sistemas de Informação",
        "institution": "Universidade Federal de Minas Gerais (UFMG)",
        "institutionUrl": "https://ufmg.br/",
        "acronym": "UFMG",
        "description": "O curso de Bacharelado em Sistemas de Informação que escolhi trilhar tem como característica principal a formação multidisciplinar, unindo fundamentos da computação com áreas como administração, ciência da informação, economia e estatística. Essa integração me permite desenvolver não apenas competências técnicas, mas também uma visão estratégica sobre como a tecnologia pode apoiar e transformar negócios.\n\nAo longo da graduação, explorei a área de Sistemas de Informação como um campo que conecta tecnologia e gestão. Em um cenário cada vez mais digital, aprendo a projetar, implementar e gerenciar sistemas que lidam com dados e informações essenciais para a tomada de decisão dentro das organizações. Essa experiência me prepara para atuar em ambientes dinâmicos, onde a adaptação e a inovação são indispensáveis.\n\nMinha formação me capacita a transitar por diferentes áreas: desenvolvimento e gerenciamento de sistemas, modelagem de bancos de dados, análise de dados, segurança da informação, gestão de projetos e integração de tecnologias. Essa diversidade de atuação reforça a versatilidade do profissional de Sistemas de Informação, que precisa compreender tanto a parte técnica quanto os processos de negócio que dão sentido ao uso da tecnologia.\n\nAlém da base sólida em programação, algoritmos, engenharia de software e matemática, o curso se diferencia por incluir disciplinas voltadas para a gestão financeira, de pessoas e para a organização e tratamento de dados. Esse equilíbrio entre tecnologia e administração contribui para que eu esteja preparado para propor soluções completas, que não apenas resolvem problemas técnicos, mas também geram valor real para as organizações.\n\nOutro ponto fundamental da minha trajetória foi a possibilidade de aprofundamento em áreas de interesse específicas, por meio de disciplinas optativas. Entre elas, destaco campos como Aprendizado de Máquina, Aprendizado Profundo para Processamento de Linguagem Natural, Empreendimentos em Informática e Medição e Qualidade de Software. Essas oportunidades me permitiram explorar novas tendências e alinhar minha formação às transformações do mercado e da sociedade.\n\nAssim, minha jornada em Sistemas de Informação foi marcada pelo aprendizado contínuo, pela integração de diferentes áreas do conhecimento e pelo compromisso de utilizar a tecnologia como ferramenta estratégica para inovação e desenvolvimento.",
        "duration": "07/2020 - 02/2025",
        "completed": true,
        "unfinished": false,
        "link": "https://dcc.ufmg.br/bacharelado-em-sistemas-de-informacao/",
        "certificate": "https://drive.google.com/file/d/12q8Ah7fF1oCDJbrxWNxgRCMyaNUlwgdZ/view?usp=sharing"
    },
    {
        "id":"2",
        "name": "Graduação em Matemática",
        "institution": "Universidade Federal de Minas Gerais (UFMG)",
        "institutionUrl": "https://ufmg.br/",
        "acronym": "UFMG",
        "description": "Iniciei minha jornada na UFMG cursando Matemática, onde pude desenvolver uma sólida formação teórica e prática. Durante esse período, aprendi não apenas a resolver problemas complexos de forma crítica e criativa, mas me aprofundei na importância da matemática como linguagem universal e ferramenta para interagir com outras áreas do conhecimento.\n\nNo entanto, percebi que o curso de Matemática não correspondia completamente às minhas expectativas profissionais e pessoais. Apesar de valorizar profundamente a matemática, decidi direcionar minha formação para um campo que permitisse uma aplicação mais prática e direta em tecnologia, sem abrir mão do contato com conceitos matemáticos.\n\nFoi assim que decidi migrar para o Bacharelado em Sistemas de Informação, curso que se destaca pela integração de conhecimentos de computação, administração, ciência da informação, economia e estatística. Essa mudança me permitiu unir o raciocínio lógico e analítico desenvolvido durante o período que cursei Matemática com habilidades técnicas e estratégicas voltadas à tecnologia da informação.\n\nNo futuro, pretendo ingressar e me graduar em Matemática, sendo que um dos meus objetivos de vida é ser professor, de forma que eu possa passar adiante todo o brilho e beleza que vejo na matemática.",
        "duration": "02/2019 - 06/2020",
        "completed": false,
        "unfinished": true,
        "link": "https://www.mat.ufmg.br/graduacao/#1461681871980-a21f189b-68bb",
        "certificate": null
    }
]
